{"class_name": "Sequential", "config": [{"class_name": "Masking", "config": {"name": "masking_1", "mask_value": -1, "trainable": true, "batch_input_shape": [null, 3, 35], "dtype": "float32"}}, {"class_name": "LSTM", "config": {"use_bias": true, "kernel_regularizer": null, "dtype": "float32", "activity_regularizer": null, "go_backwards": false, "bias_constraint": null, "unit_forget_bias": true, "dropout": 0.0, "trainable": true, "activation": "tanh", "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_sequences": false, "return_state": false, "recurrent_activation": "hard_sigmoid", "units": 64, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_1", "unroll": false, "batch_input_shape": [null, 3, 35], "implementation": 0, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "recurrent_regularizer": null, "recurrent_constraint": null, "stateful": false}}, {"class_name": "Dense", "config": {"units": 18, "use_bias": true, "kernel_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "name": "dense_1", "batch_input_shape": [null, 64], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "softmax"}}], "backend": "tensorflow", "keras_version": "2.0.8"}