{"class_name": "Sequential", "config": [{"class_name": "Masking", "config": {"dtype": "float32", "trainable": true, "batch_input_shape": [null, 3, 19], "name": "masking_1", "mask_value": -1}}, {"class_name": "SimpleRNN", "config": {"trainable": true, "return_sequences": false, "return_state": false, "name": "simple_rnn_1", "dtype": "float32", "bias_regularizer": null, "go_backwards": false, "batch_input_shape": [null, 3, 19], "recurrent_dropout": 0.0, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "unroll": false, "recurrent_constraint": null, "activation": "tanh", "stateful": false, "implementation": 0, "bias_constraint": null, "dropout": 0.0, "units": 8, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "recurrent_regularizer": null}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "activity_regularizer": null, "dtype": "float32", "activation": "linear", "bias_regularizer": null, "use_bias": true, "batch_input_shape": [null, 8], "units": 10, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "softmax", "name": "activation_1"}}], "backend": "tensorflow", "keras_version": "2.0.8"}